pepe2k/CC3000-SDK/CC3000 SDK/MSP430F5529/HTTP Server Application/HTTP Server Source/Source/Board/board.c
  // Clear all Flags
  PMMIFG &= ~(SVMHVLRIFG | SVMHIFG | SVSMHDLYIFG | SVMLVLRIFG | SVMLIFG | SVSMLDLYIFG);
	
  PMMRIE = PMMRIE_backup;                   // Restore PMM interrupt enable register
  PMMCTL0_H = 0x00;                         // Lock PMM registers for write access
	
  return PMM_STATUS_OK;  
}

/*******************************************************************************
* \brief  Decrease Vcore by one level
*
* \param  level    Level to which Vcore needs to be decreased
* \return status   Success/failure
******************************************************************************/
static uint16_t SetVCoreDown(uint8_t level)
{
  uint16_t PMMRIE_backup, SVSMHCTL_backup, SVSMLCTL_backup;
  
  // The code flow for decreasing the Vcore has been altered to work around
  // the erratum FLASH37. 
  // Please refer to the Errata sheet to know if a specific device is affected
  // DO NOT ALTER THIS FUNCTION
  
  // Open PMM registers for write access
  PMMCTL0_H = 0xA5;
	
  // Disable dedicated Interrupts 
  // Backup all registers
  PMMRIE_backup = PMMRIE;
  PMMRIE &= ~(SVMHVLRPE | SVSHPE | SVMLVLRPE | SVSLPE | SVMHVLRIE |
							SVMHIE | SVSMHDLYIE | SVMLVLRIE | SVMLIE | SVSMLDLYIE );
  SVSMHCTL_backup = SVSMHCTL;
  SVSMLCTL_backup = SVSMLCTL;
	
  // Clear flags
  PMMIFG &= ~(SVMHIFG | SVSMHDLYIFG | SVMLIFG | SVSMLDLYIFG);
  
  // Set SVM, SVS high & low side to new settings in normal mode
  SVSMHCTL = SVMHE | (SVSMHRRL0 * level) | SVSHE | (SVSHRVL0 * level);
  SVSMLCTL = SVMLE | (SVSMLRRL0 * level) | SVSLE | (SVSLRVL0 * level);
  
  // Wait until SVM high side and SVM low side is settled
  while ((PMMIFG & SVSMHDLYIFG) == 0 || (PMMIFG & SVSMLDLYIFG) == 0);
  
  // Clear flags
  PMMIFG &= ~(SVSMHDLYIFG + SVSMLDLYIFG);
  // SVS, SVM core and high side are now set to protect for the new core level
  
  // Set VCore to new level
  PMMCTL0_L = PMMCOREV0 * level;
  
  // Restore Low side settings
  // Clear all other bits _except_ level settings
  SVSMLCTL &= (SVSLRVL0+SVSLRVL1+SVSMLRRL0+SVSMLRRL1+SVSMLRRL2);
  
  // Clear level settings in the backup register,keep all other bits
  SVSMLCTL_backup &= ~(SVSLRVL0+SVSLRVL1+SVSMLRRL0+SVSMLRRL1+SVSMLRRL2);
  
  // Restore low-side SVS monitor settings
  SVSMLCTL |= SVSMLCTL_backup;
  
  // Restore High side settings
  // Clear all other bits except level settings
  SVSMHCTL &= (SVSHRVL0+SVSHRVL1+SVSMHRRL0+SVSMHRRL1+SVSMHRRL2);
  
  // Clear level settings in the backup register, keep all other bits
  SVSMHCTL_backup &= ~(SVSHRVL0+SVSHRVL1+SVSMHRRL0+SVSMHRRL1+SVSMHRRL2);
  
  // Restore backup 
  SVSMHCTL |= SVSMHCTL_backup;
  
  // Wait until high side, low side settled
  while (((PMMIFG & SVSMLDLYIFG) == 0) && ((PMMIFG & SVSMHDLYIFG) == 0));	
  
  // Clear all Flags
  PMMIFG &= ~(SVMHVLRIFG | SVMHIFG | SVSMHDLYIFG | SVMLVLRIFG | SVMLIFG | SVSMLDLYIFG);
  
  PMMRIE = PMMRIE_backup;                   // Restore PMM interrupt enable register
  PMMCTL0_H = 0x00;                         // Lock PMM registers for write access
  return PMM_STATUS_OK;		                // Return: OK
}
//*****************************************************************************
//
//! pio_init
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Initialize the board's I/O
//
//*****************************************************************************    

void pio_init()
{
	
	// Setup XT1 and XT2
	XT1_XT2_PORT_SEL |= XT1_ENABLE + XT2_ENABLE;
	
	// Init device clock
	initClk();
	
	//init Leds
	initLEDs();
        
        //Enable Switch interrupt
        PADIR &= ~0x1080;
        P1OUT |= BIT7;                      // Configure pullup resistor  
        P1DIR &= ~(BIT7);                  // Direction = input
        P1REN |= BIT7;                     // Enable pullup resistor
        P1IES |= (BIT7);                   // P1.7 Hi/Lo edge interrupt  
        P1IFG = 0;                         // P4 IFG cleared
        P1IE = BIT7; 
	
	// P2.3 - WLAN enable
	WLAN_EN_OUT &= ~WLAN_EN_PIN;                 
	WLAN_EN_DIR |= WLAN_EN_PIN;

  // P2.3 - SPI IRQ enable
	SPI_IRQ_DIR &= ~SPI_IRQ_PIN;                 

	// Port initialization for SPI operation
	SPI_SEL |= SPI_CLK + SPI_SOMI + SPI_SIMO;
	SPI_DIR |= SPI_CLK + SPI_SIMO;
	SPI_REN |= SPI_SOMI;                                   // Pull-Ups on RF Interface SOMI
	SPI_OUT |= SPI_SOMI;                                   
	
	RF_CS_SEL &= ~RF_CS;
	RF_CS_OUT |= RF_CS;
	RF_CS_DIR |= RF_CS;
	
	// Globally enable interrupts
	__enable_interrupt();
}

//*****************************************************************************
//
//! ReadWlanInterruptPin
//!
//! @param  none
//!
//! @return none
//!
//! @brief  return wlan interrup pin
//
//*****************************************************************************

long ReadWlanInterruptPin(void)
{
	// Return the status of IRQ, P2.4 
	return    (SPI_IRQ_IN & SPI_IRQ_PIN);
}

//*****************************************************************************
//
//! WlanInterruptEnable
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Enable waln IrQ pin
//
//*****************************************************************************

void WlanInterruptEnable()
{
	SPI_IRQ_IES |= SPI_IRQ_PIN;
	SPI_IRQ_IE |= SPI_IRQ_PIN;
}

//*****************************************************************************
//
//! WlanInterruptDisable
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Disable waln IrQ pin
//
//*****************************************************************************

void WlanInterruptDisable()
{
	SPI_IRQ_IE &= ~SPI_IRQ_PIN;
}

//*****************************************************************************
//
//! WriteWlanPin
//!
//! @param  val value to write to wlan pin
//!
//! @return none
//!
//! @brief  write value to wlan pin
//
//*****************************************************************************

void WriteWlanPin(uint8_t trueFalse)
{	
	if(trueFalse)
	{
		WLAN_EN_OUT |= WLAN_EN_PIN;                 // RF_EN_PIN high
	}
	else
	{
		WLAN_EN_OUT &= ~WLAN_EN_PIN;                // RF_EN_PIN low
	}
	//__delay_cycles(6000000);
}

//*****************************************************************************
//
//! unsolicicted_events_timer_init
//!
//!  @param  None
//!
//!  @return none
//!
//!  @brief  The function initializes the unsolicited events timer handler
//
//*****************************************************************************
void unsolicicted_events_timer_init(void)
{
	TA1CCTL0 &= ~CCIE; 
	TA1CTL |= MC_0;
	
	// Configure teh timer for each 500 milli to handle un-solicited events
	TA1CCR0 = 0x4000;
	
	// run the timer from ACLCK, and enable interrupt of Timer A
	TA1CTL |= (TASSEL_1 + MC_1 + TACLR);
	
