pepe2k/CC3000-SDK/CC3000 SDK/MSP430F5529/HTTP Server Application/HTTP Server Source/Source/Board/board.c
	TA1CCTL0 |= CCIE;
}


//*****************************************************************************
//
//! unsolicicted_events_timer_init
//!
//!  @param  None
//!
//!  @return none
//!
//!  @brief  The function initializes a CC3000 device and triggers it to start
//!          operation
//
//*****************************************************************************
void unsolicicted_events_timer_disable(void)
{
	TA1CCTL0 &= ~CCIE; 
	TA1CTL |= MC_0;
}

//*****************************************************************************
//
//! initClk
//!
//!  @param  None
//!
//!  @return none
//!
//!  @brief  Init the device with 16 MHz DCOCLCK.
//
//*****************************************************************************
void initClk(void)
{	
	// Set Vcore to accomodate for max. allowed system speed
	SetVCore(3);
	// Use 32.768kHz XTAL as reference
	LFXT_Start(XT1DRIVE_0);
	
	// Set system clock to max (25MHz)
	Init_FLL_Settle(25000, 762);
	SFRIFG1 = 0;
	SFRIE1 |= OFIE;
}

//*****************************************************************************
//
//! StartDebounceTimer
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Starts timer that handles switch debouncing
//
//*****************************************************************************
void StartDebounceTimer()
{  
	// default delay = 0
	// Debounce time = 1500* 1/8000 = ~200ms
	TB0CCTL0 = CCIE;                          // TACCR0 interrupt enabled
	TB0CCR0 = 3000;
	TB0CTL = TBSSEL_1 + MC_1;                 // SMCLK, continuous mode
}

//*****************************************************************************
//
//! StopDebounceTimer
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Stops timer that handles switch debouncing
//
//*****************************************************************************
void StopDebounceTimer()
{  
	// TACCR0 interrupt enabled
	TB0CCTL0 &= ~CCIE;                          
}

//*****************************************************************************
//
//! initLEDs
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Initializes LED Ports and Pins
//
//*****************************************************************************
void initLEDs()
{
	LED145678_PORT_OUT &= ~(BIT0 + BIT1 + BIT2 + BIT3 + BIT4 + BIT5);
        LED145678_PORT_DIR |= BIT0 + BIT1 + BIT2 + BIT3 + BIT4 + BIT5;
	LED23_PORT_OUT &= ~(BIT1 + BIT2);
	LED23_PORT_DIR |= BIT1 + BIT2;
}

//*****************************************************************************
//
//!  turnLedOn
//!
//! @param  ledNum is the LED Number
//!
//! @return none
//!
//! @brief  Turns a specific LED on
//
//*****************************************************************************
void turnLedOn(char ledNum)
{
	switch(ledNum)
	    {
	      case LED1:
	    	  LED145678_PORT_OUT |= BIT0;
	        break;
	      case LED2:
	    	  LED23_PORT_OUT |= BIT1;
	        break;
	      case LED3:
	    	  LED23_PORT_OUT |= BIT2;
	        break;
	      case LED4:
	    	  LED145678_PORT_OUT |= BIT1;
	        break;
	      case LED5:
	    	  LED145678_PORT_OUT |= BIT2;
	        break;
	      case LED6:
	    	  LED145678_PORT_OUT |= BIT3;
	        break;
	      case LED7:
	    	  LED145678_PORT_OUT |= BIT4;
	        break;
	      case LED8:
	    	  LED145678_PORT_OUT |= BIT5;
	        break;
	    }

}

//*****************************************************************************
//
//! turnLedOff
//!
//! @param  ledNum is the LED Number
//!
//! @return none
//!
//! @brief  Turns a specific LED Off
//
//*****************************************************************************    
void turnLedOff(char ledNum)
{              
	switch(ledNum)
	    {
	      case LED1:
	    	  LED145678_PORT_OUT &= ~BIT0;
	        break;
	      case LED2:
	    	  LED23_PORT_OUT &= ~BIT1;
	        break;
	      case LED3:
	    	  LED23_PORT_OUT &= ~BIT2;
	        break;
	      case LED4:
	    	  LED145678_PORT_OUT &= ~BIT1;
	        break;
	      case LED5:
	    	  LED145678_PORT_OUT &= ~BIT2;
	        break;
	      case LED6:
	    	  LED145678_PORT_OUT &= ~BIT3;
	        break;
	      case LED7:
	    	  LED145678_PORT_OUT &= ~BIT4;
	        break;
	      case LED8:
	    	  LED145678_PORT_OUT &= ~BIT5;
	        break;
	    }  
}

//*****************************************************************************
//
//! toggleLed
//!
//! @param  ledNum is the LED Number
//!
//! @return none
//!
//! @brief  Toggles a board LED
//
//*****************************************************************************    

void toggleLed(char ledNum)
{
	switch(ledNum)
	    {
	      case LED1:
	    	  LED145678_PORT_OUT ^= BIT0;
	        break;
	      case LED2:
	    	  LED23_PORT_OUT ^= BIT1;
	        break;
	      case LED3:
	    	  LED23_PORT_OUT ^= BIT2;
	        break;
	      case LED4:
	    	  LED145678_PORT_OUT ^= BIT1;
	        break;
	      case LED5:
	    	  LED145678_PORT_OUT ^= BIT2;
	        break;
	      case LED6:
	    	  LED145678_PORT_OUT ^= BIT3;
	        break;
	      case LED7:
	    	  LED145678_PORT_OUT ^= BIT4;
	        break;
	      case LED8:
	    	  LED145678_PORT_OUT ^= BIT5;
	        break;
	    }

}

/***************************************************************************//**
 * @brief  GetLEDStatus
 * @param  none
 * @return A 1 byte containing the status of LEDS 
 ******************************************************************************/

uint8 GetLEDStatus()
{
  uint8_t status = 0;
  
  if(LED145678_PORT_OUT & BIT0)
    status |= (1 << 0);
  if(LED23_PORT_OUT & BIT1)
    status |= (1 << 1);
  if(LED23_PORT_OUT & BIT2)
    status |= ( 1<< 2);
  if(LED145678_PORT_OUT & BIT1)
    status |= (1 << 3);
  if(LED145678_PORT_OUT & BIT2)
    status |= (1 << 4);
  if(LED145678_PORT_OUT & BIT3)
    status |= (1 << 5);
  if(LED145678_PORT_OUT & BIT4)
    status |= (1 << 6);
  if(LED145678_PORT_OUT & BIT5)
    status |= (1 << 7);
  
