pepe2k/CC3000-SDK/CC3000 SDK/MSP430F5529/HTTP Server Application/HTTP Server Source/Source/Board/board.c
  return status;
}


//*****************************************************************************
//
//! DissableSwitch
//!
//! @param  none
//!
//! @return none
//!
//! @brief  Dissable S2 switch interrupt
//
//*****************************************************************************
void DissableSwitch()
{  
	
}

//*****************************************************************************
//
//! restartMSP430
//!
//! @param  none
//!
//! @return never
//!
//! @brief   Restarts the MSP430 completely. One must be careful
//
//*****************************************************************************    
void restartMSP430()
{	
   PMMCTL0 |= PMMSWPOR;
  // This function will never exit since it forces a complete
  // restart of the MSP430.
}

void LFXT_Start(uint16_t xtdrive)
{
  // If the drive setting is not already set to maximum
  // Set it to max for LFXT startup
  if ((UCSCTL6 & XT1DRIVE_3)!= XT1DRIVE_3) { 
    UCSCTL6_L |= XT1DRIVE1_L + XT1DRIVE0_L; // Highest drive setting for XT1startup
  }
	
  while (SFRIFG1 & OFIFG) {   // Check OFIFG fault flag
    UCSCTL7 &= ~(DCOFFG+XT1LFOFFG+XT1HFOFFG+XT2OFFG); // Clear OSC flaut Flags fault flags
    SFRIFG1 &= ~OFIFG;        // Clear OFIFG fault flag
  }
  
  UCSCTL6 = (UCSCTL6 & ~(XT1DRIVE_3)) | (xtdrive); // set requested Drive mode
}

void Init_FLL_Settle(uint16_t fsystem, uint16_t ratio)
{
  volatile uint16_t x = ratio * 32;       
	
  Init_FLL(fsystem, ratio);
  
  while (x--) {
		__delay_cycles(30); 
  }
}

void Init_FLL(uint16_t fsystem, uint16_t ratio)
{
  uint16_t d, dco_div_bits;
  uint16_t mode = 0;
	
  // Save actual state of FLL loop control, then disable it. This is needed to
  // prevent the FLL from acting as we are making fundamental modifications to
  // the clock setup.
  uint16_t srRegisterState = __get_SR_register() & SCG0;
  __bic_SR_register(SCG0);  
  
  d = ratio;
  dco_div_bits = FLLD__2;        // Have at least a divider of 2
  
  if (fsystem > 16000) {
    d >>= 1 ;
    mode = 1;
  }
  else {
    fsystem <<= 1;               // fsystem = fsystem * 2
  }
	
  while (d > 512) {
    dco_div_bits = dco_div_bits + FLLD0;  // Set next higher div level
    d >>= 1;
  }
	
  UCSCTL0 = 0x0000;              // Set DCO to lowest Tap
	
  UCSCTL2 &= ~(0x03FF);          // Reset FN bits
  UCSCTL2 = dco_div_bits | (d - 1);
	
  if (fsystem <= 630)            //           fsystem < 0.63MHz
		UCSCTL1 = DCORSEL_0;
  else if (fsystem <  1250)      // 0.63MHz < fsystem < 1.25MHz
		UCSCTL1 = DCORSEL_1;
  else if (fsystem <  2500)      // 1.25MHz < fsystem <  2.5MHz
		UCSCTL1 = DCORSEL_2;
  else if (fsystem <  5000)      // 2.5MHz  < fsystem <    5MHz
		UCSCTL1 = DCORSEL_3;
  else if (fsystem <  10000)     // 5MHz    < fsystem <   10MHz
		UCSCTL1 = DCORSEL_4;
  else if (fsystem <  20000)     // 10MHz   < fsystem <   20MHz
		UCSCTL1 = DCORSEL_5;
  else if (fsystem <  40000)     // 20MHz   < fsystem <   40MHz
		UCSCTL1 = DCORSEL_6;
  else
		UCSCTL1 = DCORSEL_7;
	
  while (SFRIFG1 & OFIFG) {                               // Check OFIFG fault flag
    UCSCTL7 &= ~(DCOFFG+XT1LFOFFG+XT1HFOFFG+XT2OFFG);     // Clear OSC flaut Flags
    SFRIFG1 &= ~OFIFG;                                    // Clear OFIFG fault flag
  }
	
  if (mode == 1) {                              		  // fsystem > 16000
    SELECT_MCLK_SMCLK(SELM__DCOCLK + SELS__DCOCLK);       // Select DCOCLK
  }
  else {
    SELECT_MCLK_SMCLK(SELM__DCOCLKDIV + SELS__DCOCLKDIV); // Select DCODIVCLK
  }
  
  __bis_SR_register(srRegisterState);	                  // Restore previous SCG0
}

uint16_t SetVCore(uint8_t level)
{
  uint16_t actlevel;
  uint16_t status = 0;
  
  level &= PMMCOREV_3;                       // Set Mask for Max. level
  actlevel = (PMMCTL0 & PMMCOREV_3);         // Get actual VCore
	// step by step increase or decrease
  while (((level != actlevel) && (status == 0)) || (level < actlevel)) {
    if (level > actlevel) {
      status = SetVCoreUp(++actlevel);
    }
    else {
      status = SetVCoreDown(--actlevel);
    }
  }
  
  return status;
}

//Check if Button is Still pressed

int switchIsPressed()
{
  if(!(P1IN & BIT7))
     return 1;
  else
    return 0;       
}

void RestoreSwitchValue()
{
  //Restore the Switch value to unpressed state
  P1IFG &= SwichRestore;
}

//*****************************************************************************
//
//! StartmDNSTimer
//!
//! @brief   Starts the timer that will trigger every one second
//
//*****************************************************************************

void StartmDNSTimer(void)
{
	//Stop the Timer
    TA2CTL &= ~MC_1;
    
    // an timer that wakes the interrupt at every 1 second
    TA2CCTL0 = CCIE;                                // CCR0 interrupt enabled
    TA2CCR0 =0x7FFF;                                  // 16384/32768 = a period of 500ms
    TA2CTL = TASSEL_1 + TACLR;                      // ACLK, up mode
	TA1CCTL0 &= ~CCIE;
	TA1CTL |= MC_0;
	 // Start timer
     TA2CTL |= MC_1;
}


void StopmDNSTimer(void)
{
  //Stop the Timer
    TA2CTL &= ~MC_1;
}



// Timer A2 interrupt service routine
#pragma vector=TIMER2_A0_VECTOR
__interrupt void TIMER2_A0_ISR(void)
{              
  /* Clear the timer interrupt flag and reload */
  TA2CCTL0 &= ~CCIFG;
  skipCount++;
  if(mDNSValid ==1 && skipCount >= 10)
  {
    mDNSSend =1;
    skipCount =0;
  }
}

#pragma vector=PORT1_VECTOR
__interrupt void Port1_ISR(void)
{
    //
    // Context save interrupt flag before calling interrupt vector.
    // Reading interrupt vector generator will automatically clear IFG flag
    //

    switch (__even_in_range(P1IV, P1IV_P1IFG7))
    {
       // Vector  P1IV_NONE:  No Interrupt pending
        case  P1IV_NONE:
            break;

        // Vector  P1IV_P1IFG0:  P1IV P1IFG.0
        case  P1IV_P1IFG0:
            break;

        // Vector  P1IV_P1IFG1:  P1IV P1IFG.1
        case  P1IV_P1IFG1:
            break;

        // Vector  P1IV_P1IFG2:  P1IV P1IFG.2
        case  P1IV_P1IFG2:
            break;

        // Vector  P1IV_P1IFG3:  P1IV P1IFG.3
        case  P1IV_P1IFG3:
            break;

        // Vector  P1IV_P1IFG4:  P1IV P1IFG.4
        case  P1IV_P1IFG4:
            break;

        // Vector  P1IV_P1IFG5:  P1IV P1IFG.5
        case  P1IV_P1IFG5:
            break;

        // Vector  P1IV_P1IFG1:  P1IV P1IFG.6
        case  P1IV_P1IFG6:
            break;

        // Vector  P1IV_P1IFG7:  P1IV P1IFG.7
        case  P1IV_P1IFG7:
        	runSmartConfig = 1;
        	break;

        // Default case
        default:
            break;
    }
}

//Catch interrupt vectors that are not initialized.

#ifdef __CCS__
#pragma vector=WDT_VECTOR,TIMER1_A0_VECTOR, TIMER1_A1_VECTOR, TIMER0_A1_VECTOR, TIMER0_A0_VECTOR, TIMER2_A1_VECTOR, COMP_B_VECTOR, USB_UBM_VECTOR, UNMI_VECTOR,DMA_VECTOR, RTC_VECTOR, TIMER0_B0_VECTOR, TIMER0_B1_VECTOR,SYSNMI_VECTOR, USCI_A0_VECTOR, USCI_B0_VECTOR, USCI_B1_VECTOR
__interrupt void Trap_ISR(void)
{
  while(1);
}

#endif


